In [5]:
import pandas as pd

In [6]:
data= pd.read_csv(r'C:\Users\bini1\DSA\Students_Performance.csv')

# Displaying the data

In [7]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# a) Number of males and females participating in the test

In [12]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# b) Displaying students' parent education

In [68]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [75]:
data['parental level of education'].value_counts().max()

226

In [37]:
data['parental level of education'].value_counts().min()

59

# c)i   Most average score gender wise

In [63]:
data.groupby(['gender'])[['math score','reading score','writing score']].mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
#Male has highest average score for maths
#Female has highest average score for reading
#Female has highest average score for writing

# c)ii   Most average score test preparation course wise

In [64]:
data.groupby(['test preparation course'])[['math score','reading score','writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
#Students who completed the test preparation course scores highest average for maths, reading and writing

# d)i Scoring variation of math, reading and writing based on gender

In [10]:
data.groupby(['gender'])[['math score','reading score','writing score']].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [11]:
#The scoring variations for math, reading and writing are more among the females

# e)Top 25% students based on math score

In [94]:
sort_data= data.sort_values(by=['math score'], ascending= False)
data.drop(['average','max'], axis=1)
sort_data.head(250)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average,max
999,male,group E,bachelor's degree,standard,completed,100,100,100,100.000000,100.0
996,male,group A,some college,standard,completed,100,96,86,94.000000,100.0
515,female,group E,some college,standard,none,100,92,97,96.333333,100.0
517,female,group E,associate's degree,standard,none,100,100,100,100.000000,100.0
516,female,group E,bachelor's degree,standard,none,100,100,100,100.000000,100.0
...,...,...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77,76.666667,100.0
855,male,group E,associate's degree,free/reduced,completed,77,69,68,71.333333,100.0
854,male,group D,some high school,standard,completed,77,68,69,71.333333,100.0
853,male,group D,associate's degree,free/reduced,none,77,78,73,76.000000,100.0
852,male,group D,some college,free/reduced,none,77,62,64,67.666667,100.0